Revit 2024 API
ParameterTypeId.StructuralDisplayInHiddenViewsFraming Property
 "Display in Hidden Views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralDisplayInHiddenViewsFraming { get; }
Visual Basic
Public Shared ReadOnly Property StructuralDisplayInHiddenViewsFraming As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralDisplayInHiddenViewsFraming {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace